{
    "documentType": "Director's Notes",
    "sceneNumber": "[Scene Number]",
    "sceneHeading": "[Scene Heading, e.g., INT. VITO'S OFFICE - NIGHT]",
      "sceneSummary": "[A brief summary of the scene and what happens]",
    "purpose": "[Briefly describe the scene's narrative purpose and impact on the story]",
    "emotionalImpact": {
          "intendedEmotion": "[The primary emotion the scene should evoke, e.g., Betrayal, Despair, Tension, Violence]",
          "techniques": [
              {
                  "technique": "Irony",
                  "type": "[Type of irony, e.g., Dramatic, Situational, Verbal]",
                   "description": "[How irony should be used in the scene to create a specific effect. Example: Michael lying to Kay about his involvement in Connie's husband's murder is verbal irony. The audience also knows that Kay is now fully alienated and deceived, which is dramatic irony.]"
              },
              {
                  "technique": "Rule of Three",
                 "description": "[How can the rule of three be used to enhance the dialogue, action, or emotional impact in the scene. Example: A character outlines a plan with three steps, emphasizing the final point]"
               },
               {
                    "technique":"Montage",
                    "description":"[When and how to use montages in the scene to compress time, and the emotional impact it should have. Example: How a montage can show the change of a character over time, with the character growing older or more isolated.]"
              },
                {
                   "technique":"Character Arcs",
                   "description":"[How does this scene affect the characters in question and the audience's understanding of the character's emotional arc. Example: This scene marks Michael's full transformation into a ruthless leader, and the final stage of his negative arc.]"
               }
              ],
          "notes": "[Any additional notes on the scene’s emotional context or desired overall emotional effect. Example: This scene is intended to be a gut punch, and the audience should feel a sense of profound loss and betrayal.]"
      },
      "characterNotes": [
          {
              "character": "[Character Name, e.g., Michael Corleone]",
              "performanceNotes": "[Detailed notes for the actor on how to portray the character in this scene, including tone, subtext, or specific actions. Example: Michael should be cold and calculating, with a piercing gaze and a hardened expression. His interactions with Kay should be devoid of warmth or affection.]",
               "dialogue": "[How any dialogue or V.O. should be delivered, including subtext or tone. Example: Michael’s dialogue should be delivered with a flat affect, and any lies should be delivered with conviction. Any V.O. should emphasize a feeling of isolation and despair.]",
              "costume": "[How the costume impacts the character in this scene. Example: Michael's formal and expensive attire in this scene should emphasize his position of power and wealth, but also create a stark contrast with his previous military uniform or civilian clothes]"
          },
         {
              "character":"[Character Name, e.g., Kay Adams]",
              "performanceNotes":"[Detailed notes for the actor on how to portray the character in this scene, including tone, subtext, or specific actions. Example: Kay’s demeanour should change from hopeful, to distraught, to despairing by the end of the scene. She should be reacting to Michael's deception and lies.]",
               "dialogue":"[How any dialogue or V.O. should be delivered, including subtext or tone. Example: Kay’s dialogue should convey a sense of devastation and betrayal. Her reactions to Michael’s lies should come across as painful. Any V.O should indicate the complete end of her relationship with Michael.]",
              "costume":"[How the costume impacts the character in this scene. Example: Kay’s clothing should reflect her loss of innocence, moving from light colours to dark, or casual to more formal attire to emphasize her changed status.]"
           }
      ],
    "blockingNotes": "[General notes on character movement and positions within the scene. Example: Michael remains seated and in control, while Kay is more mobile but increasingly isolated by the end of the scene.]",
   "timeOfDay": "[Specific time of day and any special conditions for production. Generally these should be avoided unless integral to the story. Example: This scene is set at night, which emphasizes the dark and sinister nature of Michael’s actions, and also creates a feeling of isolation.]",
   "props": [
          {
               "objectName": "[Name of the prop, e.g., The Godfather’s chair]",
               "description": "[Description of the prop and its significance. Example: Michael sitting in his father's chair signifies his full transition of power]",
                "useCase": "[How and when to use the prop. Example: Michael should be seated in the chair throughout the scene, emphasizing his dominance and power.]"
          }
      ],
    "specialEffects": [
          {
              "effectType": "[Special Effect type, e.g., PRACTICAL, VISUAL, SFX MAKEUP]",
              "description": "[How the special effect should look or function in the scene. Example: The special effect is Michael’s hardened expression and cold demeanour.]"
           }
    ],
    "notes": "[Any other important information for the director, e.g., specific themes, or references to other scenes. Example: This scene should show how Michael has become fully corrupted by power, and how he has sacrificed his relationship with Kay. It is a bookend to the initial scene where he was an outsider looking in to the family’s business]"
  },
  {
      "documentType": "Cinematography Notes",
      "sceneNumber": "[Scene Number]",
      "sceneHeading": "[Scene Heading, e.g., INT. VITO'S OFFICE - NIGHT]",
      "sceneSummary": "[A brief summary of the scene and what happens]",
      "purpose": "[Briefly describe the scene's purpose within the narrative]",
      "visualElements": {
          "setting": {
              "locationType": "[INT, EXT, INT/EXT]",
              "timeOfDay": "[DAY, NIGHT, MORNING, EVENING, CONTINUOUS, MOMENTS LATER, or any conditions important to the scene. Example: NIGHT. The dimly lit office should emphasize the isolation and corruption in the scene.]",
              "details": "[Additional setting details using multiple hyphens, subheadings, or specific geographical information. Example: The office should feel oppressive and isolating, and emphasize the themes of power and corruption.]"
          },
        "cinematography": {
            "cameraShots": [
               "[Camera shot type, e.g., CLOSE UP on Michael's eyes]",
               "[Camera shot type, e.g., WIDE SHOT to isolate Kay]",
               "[Camera shot type, e.g., MEDIUM SHOT to frame the two characters together]"
            ],
             "cameraAngle": [
                  "[Camera angle type, e.g., LOW ANGLE on Michael to emphasize power]",
                  "[Camera angle type, e.g., EYE LEVEL for Kay to show her perspective]"
              ],
             "lighting": [
                  "[Lighting type, e.g., LOW KEY lighting to enhance the dark mood]",
                 "[Lighting type, e.g., ARTIFICIAL light to create stark contrasts]",
                  "[Lighting type, e.g., Use shadows to emphasize the moral darkness of the scene.]"
             ],
             "movement": [
                  "[Camera movement, e.g., SLOW ZOOM to Michael to emphasize his coldness]",
                  "[Camera movement, e.g., TRACKING shot to follow Kay to the door as she leaves]",
                  "[Camera movement, e.g., minimal camera movement to emphasize the stillness and unease of the scene]"
              ],
            "notes": "[Any additional notes on camera work, including when to use or avoid specific shots. Example: Shots should emphasize the characters’ isolation and moral corruption. Camera shots should only be specified when they are critical to the scene]"
        },
        "specialEffects": [
              {
                   "effectType": "[Special Effect type, e.g., PRACTICAL, VISUAL, SFX MAKEUP]",
                    "description": "[Description of the special effect and how it should look in the scene. Example: Visual effects should be minimal, and focus on enhancing the feeling of despair and betrayal.]",
                    "timePeriod": "[If the special effects relate to a specific time period]"
                }
          ]
      },
      "soundElements": {
          "music": {
               "musicType": "[DIEGETIC, NON-DIEGETIC]",
               "mood": "[The desired mood for the music, e.g., SAD, DRAMATIC]",
               "description": "[Details of how the music is used in the scene. Example: Non-diegetic music should be subtle, and build tension as Michael deceives Kay, then resolve into despair as Kay’s character leaves. Use of violins or other mournful instruments is ideal.]"
          },
         "soundEffects": [
            {
                  "effectType": "[Sound effect type, e.g., AMBIENT, SPECIFIC, IMPACT]",
                  "description": "[Details of how the sound should sound and when it should occur in the scene. Example: Focus on the sound of the door closing, which should emphasize that Kay is now locked out of Michael's life. Other ambient noises should be low and emphasize the isolation.]",
                  "avScriptColumn":"[Which audio column the SFX should be included in, in an AV script]"
              }
          ]
      },
      "transitions":"[What transitions to include between scenes. Only specify if it is important, a standard cut will be assumed without transition information. Example: Use a hard cut to the next scene to emphasize the finality of Michael’s decision.]",
     "notes": "[Any other notes related to cinematography for the scene. Example: The scene should feel claustrophobic and tense, mirroring the emotional state of Kay and the corruption of Michael.]"
  }